{
  "common.or": "ou",
  "common.and": "e",
  "main.title": "Svelte Intl Precompile",
  "main.subtitle": "A librería de i18n para Svelte que analiza e transforma as túas traduccións en tempo de compilación.",
  "playground.title": "Playground",
  
  "introduction.title": "Introducción",
  "introduction.subsection.why-use-it": "¿Por qué querería usala?",
  "introduction.paragraph.why-use-it-1": "Svelte-intl-precompile é unha librería de i18n para apps Svelte que busca proporcionar todas as funcionalidades ca túa app pode precisar co mínimo impacto tanto no tamaño da túa app como na súa velocidade de execución",
  "introduction.paragraph.why-use-it-2": "Para logralo usa una solución diferente á maioría de librerías de internacionalización. De forma semellante a como Svelte.js analiza y comprende o teu código e durante a compilación tranfórmao en javascript compacto e eficiente, esta librería inspeciona as túas traduccións escritas na <a href='https://lokalise.com/blog/complete-guide-to-icu-message-format' class='text-primary underline'>ICU message syntax</a> e compílaas a funcions pequenas e optimizadas.",
  "introduction.paragraph.why-use-it-3": "Se usas todas e cada unha das funcionalidades soportadas pola sintaxis ICU añadirá aproximadamente 2kb a teua app despois do minificado e da compresión. Se soamente usas unhas poucas das funcionalidades esa cifra pode baixar asa tan só 1kb",
  "introduction.paragraph.why-use-it-4": "Dado que non ten que parsear e tokenizar as túas traduccións no navegador, tamén é máis rápido. Como 4 veces máis rápido renderizando traduccións a primeira vez, e arredor do 50% máis rápido renderizando traduccións que xa encontrara antes.",
  "introduction.subsection.playground": "¿¡Qué!? Amósame o código",
  "introduction.paragraph.playground-preface": "Aquí tes, próbao. Pega as túas propias traduccións e observa o resultado da compilación",
  "introduction.subsection.features": "¿Qué funcionalidades soporta?",
  "introduction.paragraph.features-1": "Todas as funcionalidades da sintaxis ICU están soportadas.<br>Ten unha API case completamente compatible con",
  "introduction.paragraph.features-2": ", outra librería de internacionalización moi popular e ben deseñada para Svelte.js ",
  "introduction.paragraph.features-3": "As principais funcionalidades inclúen:",
  "introduction.list-items.features-1": "Traduccións con interpolacions, seleccionar ramas de subtraduccións en base a valores e o resto de funcionalidades de ICU.",
  "introduction.list-items.features-2": "Formatear datas, tempos, números, ordinais e divisas, todo apoiándose na API Intl presente en tódolos navegadores modernos e en Node.",
  "introduction.list-items.features-3": "Unha API deseñada para Svelte.js que poporciona uns convenientes stores que actualizan os seus valores automáticamente cando o idioma seleccionado ou as traduccións cargadas actualízanse.",
  "introduction.list-items.features-4": "Unha variedade de funcions pra cargar paquetes de idiomas asíncronamente cando sexa necesario, utilidades para extraer o idioma predeterminado das cabeceras da petición HTTP en modo SSR",
  "introduction.list-items.features-5": "Tree-shaking completo de tódalas utilidades arriba mencionadas que a túa aplicación non precise",

  "icu-crash-course.title": "ICU syntax: Cursillo acelerado",
  "icu-crash-course.table-heads.definition": "Entrada",
  "icu-crash-course.table-heads.values": "Valores",
  "icu-crash-course.table-heads.output": "Saída",
  "icu-crash-course.paragraph.main-1": "Esta libraría analiza e compila as traduccións creadas na syntaxis ICU. Inda que a sintaxis ICU é un proxecto independiente este é un cursillo acelerado de porqué é interesante e como usar as súas principais funcionalidades",
  "icu-crash-course.subsection.why": "¿Porqué usar a sintaxis ICU?",
  "icu-crash-course.paragraph.why-1": "ICU son as seglas de <em class='italic'>International Components for Unicode</em>. Inda que a súa popularidade comenzou con C/C++ y Java, é no ecosistema javascript onde se convertiu no standard de facto para internacionalización, inda que tamén é popular en Python e PHP",
  "icu-crash-course.paragraph.why-2": "Internacionalizar aplicacions é moito máis que mapear unha clave á traducción apropiada nun diccionario. Aplicacions internacionalizadas debidamente deben xestional tódolos aspectos da traducción, incluindo a forma en que datas y tempos se formatean, qué delimitadores urar nos números para separar os millares ou os decimais, formateo de divisas y soporter idiomas con xéneros.",
  "icu-crash-course.paragraph.why-3": "Incluso algo tan aparentemente sixelo coma os plurais pode resultar moi complicado nalguns idiomas. O inglés, español e alemán teñen só un singular e un plural pero algúns idiomas eslavos teñen tres, e outros como o árabe teñen 6 dependiendo do número de elementos. As veces o número a partir do que se cambia dunha forma do plural á seguinte varía dependendo da variante rexional. <br> O inglés non ten moitas palabras con dous xéneros pero o francés e o castelán sí, e os adxectivos desos sustantivos deben respetar ese xénero. Formatear <code class='inline'>123456789</code> en inglés americano resultará en <code class='inline'>123,456,789</code> pero en inglés da India será <code class='inline'>12,34,56,789</code>. <br> Formateando divisas o símbolo $ vai diante da cantidade pero o € vai despois.",
  "icu-crash-course.paragraph.why-4": "A sintaxis ICU abstrae toda esta complexidade dos desarrolladores e da os verdadeiros traductores profesionais un meta-lenguage suficientemente expresivo para xestional todas as sutilezas pola súa conta",
  "icu-crash-course.subsection.interpolations": "Interpolacions",
  "icu-crash-course.paragraph.interpolations-1": "As entradas ICU soportan interpolar valores, que serán adecuadamente saneados, polo que pasar <code class='inline'>undefined</code> no será interpolado como <em class='italic'>\"undefined\"</em>.",
  "icu-crash-course.table-cells.interpolations": "Your favorite color is {chosen}",
  "icu-crash-course.subsection.plurals": "Plurais",
  "icu-crash-course.paragraph.plurals-1": "A segunda funcionalidade máis usada en cualqueira aplicación é a pluralización. A sintaxis ICU proporciona a utilidade <code class='inline'>plural</code> para definir traduccións para s plurais dende os máis sixelos os máis complexos, todo sen sair da sintaxis en sí mesma.",
  "icu-crash-course.paragraph.plurals-2": "Cada posibilidade de pluralización está predecida dun calificador numérico. As posibles opcions son:",
  "icu-crash-course.paragraph.plurals-3": "Vexámolo cuns exemplos:",
  "icu-crash-course.paragraph.plurals-4": "Algúns idiomas coma o inglés soamente utilizan <code class='inline'>one</code> e <code class='inline'>other</code> pero outros idiomas serán capaces de seleccionar sempre o plural máis adecuando. O límite particular que divide <code class='inline'>few</code> e <code class='inline'>many</code> é altamente cultural.",
  "icu-crash-course.paragraph.plurals-5": "Podes tamén especificar traduccións para cantidades específicas usando <code class='inline'>=N</code>. Cando un número específico é especificado de esta maneira tomará precedencia sobre o comportamiento por defecto dos plurais nese idioma. <br> Por exemplo, en inglés podes usar <code class='inline'>=2</code> ou <code class='inline'>=12</code> para usar diferentes traduccións específicamente para un par y una ducia de elementos en lugar de usar o plural xenérico.",
  "icu-crash-course.paragraph.plurals-6": "Por último, os plurais pueden utilizar a almoadilla para imprimir como número o valor usado para seleccionar o plural e opcionalmente a utilidade pode recibir un offset que será restado do valor antes de reemplazar a almoadilla.",
  "icu-crash-course.list-items.one": "(singular)",
  "icu-crash-course.list-items.two": "(dual)",
  "icu-crash-course.list-items.few": "(paucal)",
  "icu-crash-course.list-items.many": "(Tamén usado para fraccions)",
  "icu-crash-course.list-items.other": "(plural xenérico. O usado en idiomas con só unha forma de plural)",
  "icu-crash-course.table-cells.plurals-simple": "Your have {numCats, plural, one {one cat} other {# cats}}",
  "icu-crash-course.table-cells.plurals-complex": "Your have {numCats, plural, =0 {no cats at all} one {one single cat} =2 {a couple cats} =3 {a trio of cats} =12 {a dozen cats} other {exactly # cats}}",  
  "icu-crash-course.table-cells.plurals-offset": "{guestCount, plural, offset:1 =0 {Mary does not give a party.} =1 {Mary invites {guest} to her party.} =2 {Mary invites {guest} and one other person to her party.} other {Mary invites {guest} and # other people to her party.}}",
  "icu-crash-course.subsection.select": "Select",
  "icu-crash-course.paragraph.select-1": "A utilidade <code class='inline'>select</code> úsase para elexir entre varias posibles traduccións en base ó valor dun argumento.<br> Inda que ten moitos usos o máis frecuente é para ter traduccións dependentes do xénero.",
  "icu-crash-course.table-cells.select": "Your {childGender, select, male {son} female {daughter} other {child}} has won an award",
  "icu-crash-course.table-cells.select-value-male": "Male",
  "icu-crash-course.table-cells.select-value-female": "Female",
  "icu-crash-course.table-cells.select-value-unknown": "Unknown",
  "icu-crash-course.subsection.date": "Datas",
  "icu-crash-course.paragraph.date-1": "Esta utilidade utilízase para formatear datas de acordo as regras do idioma para os formatos por defecto ou os formatos persoalizados que engadiches o inicializar a librería.<br> Os formatos disponibles por defecto son:",
  "icu-crash-course.list-items.short": ": A representación más abreviada (numérica)",
  "icu-crash-course.list-items.medium": ": Representación textual abreviada",
  "icu-crash-course.list-items.long": ": Representación textual extendida",
  "icu-crash-course.list-items.full": ": A representación máis completa",
  "icu-crash-course.table-cells.date": "Your next holidays start on {holidayStart, date, full}",
  "icu-crash-course.subsection.time": "Horas",
  "icu-crash-course.paragraph.time": "Idéntico á utilidade para datas pero para foratear únicamente a parte temporal dun obxeto Date.",
  "icu-crash-course.table-cells.time": "Your doctor's appointment is today at {appointment, time, short}",
  "icu-crash-course.subsection.number": "Números",
  "icu-crash-course.paragraph.number": "Formatea un número de acordo as regras do idioma seleccionado.",
  "icu-crash-course.table-cells.number": "Your account balance is {num, number}",

  "getting-started.title": "Primeiros pasos",
  "getting-started.subsection.installation": "Instalación",
  "getting-started.paragraph.installation-1": "Instala svelte-intl-precompile coma unha dependencia de runtime do teu proxecto Svelte.",
  "getting-started.subsection.create-translations": "Crea as túas traduccións",
  "getting-started.paragraph.create-translations-1": "A continuación crea o directorio onde por os teus ficheiros de traduccións. A min gustame usar {dir1} {or} {dir2}",
  "getting-started.paragraph.create-translations-2": "no raiz do proxecto, pero en realidade podes colocar o directorio onde prefiras",
  "getting-started.paragraph.create-translations-3": "Recomiendo usar ficheiros .json pero podes tamén crear ficheiros javascript que exporten un único obxeto que contén as traduccións. Calqueira que sexa a túa preferencia, as traduccións son simples cadeas coa sintaxis ICU:",
  "getting-started.paragraph.create-translations-4": "Eu prefiero o diccionario de traduccións teña un único nivel e usar puntos para crear xerarquías coma o de enriba, pero tamén podes aniñar obxetos coma a continuación:",
  "getting-started.subsection.hook-into-sveltekit": "Acomplar o compilador a SvelteKit",
  "getting-started.paragraph.hook-into-sveltekit-1": "O compilador desta librería necesita integrarse no proceso de complilado de SvelteKit do teu proxecto. Para elo engadep a lista de plugins de vite no teu <code class=\"bg-code px-2\">{path}</code>",
  "getting-started.paragraph.hook-into-sveltekit-2": "E xa está todo listo. Tempo de usar a librería.",
  "getting-started.subsection.hook-into-vite": "Acoplar o compilador a Vite.js",
  "getting-started.paragraph.hook-into-vite-1": "Se non estás a usar SvelteKit senon simplemente Vite.js a configuración é moy semellante. O fin e o cabo SvelteKit usa Vite.js internamente. Importa o compilador e engádeo á lista de plugins en <code class=\"bg-code px-2\">{path}</code>",

  "configuration.title": "Configuración",
  "configuration.subsection.example": "Exemplo de configuración",
  "configuration.link.example": "Exemplo",
  "configuration.paragraph.example-1": "Este é o exemplo máis básico de inicialización da librería. Copia esto no teu",
  "configuration.paragraph.example-2": ".",
  "configuration.paragraph.example-3": "Esto es suficiente para ir comenzando pero vamos a profundizar máis en todas as opcions que tes.",
  "configuration.subsection.static-locales": "Engadir idiomas estáticamente",
  "configuration.paragraph.static-locales-1": "Coma no exemplo anterior, a forma máis sixela de angadir entradas ó diccionario é simplemente importar o módulo que contén as traduccións e angadilas usando",
  "configuration.paragraph.static-locales-2": "Observa que a pesar de que definiches as túas traduccións nun ficheiro JSON aquí as estamos importando como se fosen módulos ES6 situados en ",
  "configuration.paragraph.static-locales-3": ". Esto es porque la librería ha transformado las traduccións en un módulo con funciones durante la compilación.",
  "configuration.paragraph.static-locales-4": "Esta estratexia está cargando todos esos idiomas incluso se soamente un vai acabar mostrado. Esto non soe ser un problema cando estás a comenzando o desenvolvemento dun novo proxecto ou se o teu proyecto ten poucas traduccións ou poucos idiomas, pero cando a túa aplicación comenza a crecer debería empezar a cargar os paquetes de traduccións baixo demanda.",
  "configuration.subsection.dynamic-locales": "Engadir idiomas dinámicamente",
  "configuration.paragraph.dynamic-locales-1": "Unha vez tes unha cantidad significativa de traduccións en varios idiomas sería moi ineficiente cargar todos eles para cada usuario cando só vai utilizar o que haxa seleccionado. A librería ten una función",
  "configuration.paragraph.dynamic-locales-2": "para dinámicamente importar idiomas cando o usuario o seleccione e outra función",
  "configuration.paragraph.dynamic-locales-3": "para esperar a que a carga estea finalizada.",
  "configuration.paragraph.dynamic-locales-4": "Se todos os teus idiomas cargan dinámicamente debes impedir que a app prosiga o renderizado ata que o paquete do idioma inicial estea cargado. Retornando ol resultado de invocala dende a función",
  "configuration.paragraph.dynamic-locales-5": "proporcionada por SvelteKit fará exactamente iso.",
  "configuration.subsection.dynamic-locales-shorthand": "Engadir idiomas dinámicamente (pero máis rápido esta vez)",
  "configuration.paragraph.dynamic-locales-shorthand-1": "Se tan só queres rexistar tódolos idiomas dispoñibles (é dicir, todos aquelos para os que tes un ficheiro JSON con traduccións) automáticamente, hay un atallo moi práctico para facelo. A carpeta",
  "configuration.paragraph.dynamic-locales-shorthand-2": "de onde importas as traduccións funciona tamén coma un módulo de onde podes importar dúas utilidades: ",
  "configuration.paragraph.dynamic-locales-shorthand-3": "A primera é unha función que cando se invoca equivale a chamar",
  "configuration.paragraph.dynamic-locales-shorthand-4": "para cada un dos idiomas.<br> A segunda é un array cos códigos ISO dos idiomas dipoñibles (tanto se os rexistraches coma se inda non), para que teñas esa información dispoñible se a necesitas utilizar.",
  "configuration.subsection.init": "Idiomas inicial e de rescate",
  "configuration.paragraph.init-1": "Á invocación",
  "configuration.paragraph.init-2": "as opcions máis importantes son",
  "configuration.paragraph.init-3": ". A primeira determina o idioma no que a app vai ser renderizada inicialmente y o segundo o idioma que se usará como derradeida opción cando unha entrada non se atope no diccionario do idioma actual.",
  "configuration.paragraph.init-4": "Hay moitas cousas que se poden facer para lograr a experiencia de usuario perfecta, como convenientemente inicializar",
  "configuration.paragraph.init-5": "ó idioma seleccionado polo usuario durante o rexistro se fixo login, obtindo das cookies si xa visitara a página anteriormente ou obtelo da cabeceira <pre class='inline'>Accept-Language</pre> da petición HTTP cando se renderiza no servidor, pero a máis sixela é detectar o idioma do navegador ou da URL coas utilidades proporcionadas para elo.",
  "configuration.subsection.find-locale": "Atopar o mellos idioma",
  "configuration.paragraph.find-locale-1": "Hai múltiples estratexias válidas para seleccionar o mellor idioma que pasar á función",
  "configuration.paragraph.find-locale-2": ". Esta librería proporciona utilidades para as estratexias máis comuns:",
  "configuration.definitions.navigator": "Extrae o idioma do navegador, que a súa vez é o idioma do sistema operativo.",
  "configuration.definitions.query": "Extrae o idioma no parámetro dado a query string da URL.<br>P.e <pre class='inline'>getLocaleFromQueryString('lang')</pre> para <pre class='inline'>/users?sort=name&amp;dir=asc&amp;lang=es</pre>",
  "configuration.definitions.hash": "Como <pre class='inline'>getLocaleFromQueryString</pre> pero para el hash de la URL.<br>P.e <pre class='inline'>getLocaleFromHash('lang')</pre> para <pre class='inline'>/users#sort=name&amp;dir=asc&amp;lang=es</pre>",
  "configuration.definitions.path": "Extrae o idioma dos segmentos da URL.<br>P.e <pre class='inline'>getLocaleFromPathname(/^\/((es|en)(-\\w\\w)?)/)</pre> para <pre class='inline'>myapp.com/en-US/users</pre>",
  "configuration.definitions.host": "Extrae o idioma del host.<br>P.e <pre class='inline'>getLocaleFromHostname(/^((es|en)(-\\w\\w)?)\\./)</pre> para <pre class='inline'>https://pt.myapp.com</pre>",
  "configuration.subsection.custom-formats": "Formatos persoalizados",
  "configuration.paragraph.custom-formats-1": "Esta librería pode formatear números, datas e horas. Faino sen incrementar significativamente o tamaño do teu proxecto porque utiliza a API Intl xa presente en todos os navegadores modernos e main en Node.js.<br/>Por defecto a túa app dispón de estos formatos pero podes engadir os teus propios.",
  "configuration.paragraph.custom-formats-2": "Se queres definir os teus propios formatos pásaos ó incializar a librería usando a opción",
  "configuration.paragraph.custom-formats-3": ", os cuales serán engadidos ós formatos por defecto listados arriba. Os formatos deben ser obxetos válidos para pasar a",
  
  "usage.title": "Uso",
  "usage.paragraph.preface-1": "A API de esta librería foi tomada en gran parte da excelente",
  "usage.paragraph.preface-2": ", hasta o punto de que na maioría de proxectos podes cambiar de svelte-i18 a svelte-intl-precompile e vice versa sen modificar a túa aplicación máis que actualizado o nome do paquete dende o que importas as funcions.",
  "usage.paragraph.preface-3": "Su API basada en \"stores\" es especialmente práctica de utilizar en las plantillas y provee el beneficio añadido de hacer toda tu aplicación ractiva, automáticamente actualizando cada traducción si el usuario cambia de idioma o se cargan nuevas traduccións. Para los siguientes ejemplos vamos a asumir que está trabajando en una aplicación que contiene las siguientes traduccións.",
  "usage.link.basic-translations": "Traduccións básicas",
  "usage.subsection.basic-translations": "Traduccións básicas: O store <pre class='inline'>$t(key, ops)</pre>.",
  "usage.paragraph.basic-translations-1": "Este store é o que utilizarás máis a miudo. Simplemente impórtao e usa a función que contén, pasándolle o nome da traducción a usar.",
  "usage.subsection.passing-arguments": "Pasar argumentos",
  "usage.paragraph.passing-arguments-1": "O segundo argumento recibido por",
  "usage.paragraph.passing-arguments-2": "é un obxecto. Calquer argumento requerido dentro da traducción proporciónase coa opción",
  "usage.paragraph.passing-arguments-3": ".",
  "usage.paragraph.passing-arguments-4": "Non hai ningunha diferencia pasando argumentos dependendo de se van a interpolar ou usarse para computar plurais ou sub-ramas, ou son números ou datas para ser formateados. Todos os argumentos pásanse da mesma maneira.",
  "usage.subsection.formatting": "Formatear datas, horas y números",
  "usage.paragraph.formatting-1": "Inda que podes pasar números, datas e horas as túas traduccións que serán formateadas segindo o que a mesaxe ICU indique, a librería tambien ten outros stores para cando necesitas formatear directamente dende o teu código.",
  "usage.subsection.other-stores": "Outros stores",
  "usage.paragraph.other-stores-1": "Hai tres stores máis que paga a pena mencionar:",
  "usage.paragraph.other-stores-2": "Imos crear un compoñente para seleccionar o idioma actual",
  "usage.paragraph.other-stores-3": "O código de arriba é bastante sinxelo. Tan só iteramos a lista de idiomas dispoñibles en <code class='bg-code px-2'>$locales</code> e renderizamos un botón por cada in. Facendo click nesos botons asignará o seu dioma o store <code class='bg-code px-2'>$locale</code>.<br/> Todas as traduccións da app sactualizaranse sen necesidade de recargar a página.",
  "usage.definitions.other-stores-1": "Pode ser usado para leer ou asignar o idioma actual. (P.e: <pre class='inline'>\"es-ES\"</pre>).",
  "usage.definitions.other-stores-2": "Contén a lista de idiomas rexistrados. (P.e: <pre class='inline'>[\"es-ES\", \"en\", \"pt-BR\"]</pre>).",
  "usage.definitions.other-stores-3": "Contén <pre class='inline'>true</pre> cando un idioma asíncrono todavía está cargando."
}